'''
Шаблоны RE
'''
class RePattern:
    # Декомпозиция текста
    text_type = r'(?i)[\S\s]{0,500}'
    text_tribun = r'(?i)(С\s*у\s*д\s*е\s*б\s*н\s*ы\s*й\s*п\s*р\s*и\s*к\s*а\s*з)[\S\s]{0,400}'
    text_debtor = r'(?i)(должник)[\S\s]{0,100}'      # Резулятивная часть
    # text_debt_sp = r'(?i)((должник)|(?<=гпк)|(?<=кодекса))[\S\s]+(?= в пользу|)'
    text_debt_sp = r'(?i)((должник)|(взыскать\s+с))[\S\s]{0,100}'
    text_credit = r'(?i)(?<= по\wьзу)[\S\s]+'
    text_debt1 = r'(?i)(по\wьзу[\S\s]+)(?=по\w+лин)'                # Текст с долгом
    text_duty1 = r'(?i)(по\w+лин[\S\s]+)'                        # Текст с пошлиной

    text_all = r'[\S\s]+'
    text_verdict_opr = r'(?i)(о\s*п\s*р\s*е\s*д\s*е\s*л\s*и\s*л)[\S\s]+|(о\s*п\s*р\s*е\s*д\s*е\s*л\s*и\s*л\s*а)[\S\s]+'
    text_resolution = r'(?i)(?<=постановил)[\S\s]+'

    # Поиск заголовка
    heading_sp = r'(С\s*У\s*Д\s*Е\s*Б\s*Н\s*Ы\s*Й\s*П\s*Р\s*И\s*К\s*А\s*З)(?=\s+)'    #Пример: text_head = Судебный приказ
    heading_opr = r'(О\s*П\s*Р\s*Е\s*Д\s*Е\s*Л\s*Е\s*Н\s*И\s*Е)'
    heading_dec = r'(Р\s*Е\s*Ш\s*Е\s*Н\s*И\s*Е)(?=\s+И|\s+К|\s+г|\s+\(|\s+\d|\s+ы|\s+\W)'
    heading_res = r'(П\s*О\s*С\s*Т\s*А\s*Н\s*О\s*В\s*Л\s*Е\s*Н\s*И\s*Е)(?=\s+о|\s+в|\s+по|\s+СПИ)|(Постановление)(?=\s+об|\s+в|\s+по|\s+СПИ)|@\S+fssp|(А\s*К\s*Т)|([\d\/\-\s]{5}Определение)'
    heading_act = r'(?i)(А\s*к\s*т)'

    # heading4 = r'(?i)(ИСПОЛНИТЕЛЬНЫЙ\s*ЛИСТ)(?=\s*Дело)'
    heading4 = r'(?i)(И\s*С\s*П\s*О\s*Л\s*Н\s*И\s*Т\s*Е\s*Л\s*Ь\s*Н\w+\s*Л\s*И\s*С\s*Т)(?=[\S\s]+Дело)'
    heading5 = r'(?i)(П\s*о\s*с\s*т\s*а\s*н\s*о\s*в\s*л\s*е\s*н\s*и\s*е)'
    heading6 = r'(О\s*П\s*Р\s*Е\s*Д\s*Е\s*Л\s*Е\s*Н\s*И\s*Е)|(Р\s*Е\s*Ш\s*Е\s*Н\s*И\s*Е)(?=\s+И|\s+К|\s+г|\s+\(|\s+\d|\s+ы|\s+\W)|(С\s*У\s*Д\s*Е\s*Б\s*Н\s*Ы\s*Й\s*П\s*Р\s*И\s*К\s*А\s*З)(?=\s+)|(П\s*О\s*С\s*Т\s*А\s*Н\s*О\s*В\s*Л\s*Е\s*Н\s*И\s*Е)(?=\s+о|\s+в|\s+по|\s+СПИ)|(Постановление)(?=\s+об|\s+в|\s+по|\s+СПИ)|@\S+fssp|(А\s*К\s*Т)|([\d\/\-\s]{5}Определение)'


    # heading_fns = r'(?i)(уведомление\s*о\s*состоявшейся\s*уступке)'                             # Для Уведомления

    heading_dubl = r'(?i)(д\s*у\s*б\s*л\s*и\s*к\s*а\s*т)'

    # Дата
    date_doc1 = r'(?i)((\d{2}\s*»\s+\w{3,8}\s+\d{4})|(\d{2}\s+\w{3,8}\s+\d{4})|(\d{2}\.\d{2}\.\d{4}))'   # Дата документа
    date_doc2 = r'(?i)(?<=«)[\d.»\s\_]+\w{3,8}[\d.\s\_]+'   # Дата документа
    date_doc3 = r'(\d{2}\.\d{2}\.\d{4})'
    birthday1 = r'(?i)((\d{2}\.\d{2}\.\d{4}|\d{2}\s+\w+\s+\d{4})(?= года\s+рождения| г.р))'   # День рождения

    # Номер документа
    num_doc1 = r'(?i)((?<=дело №)\s*|(?<=производство)|(?<=№)\s*)([\w\d\-\s]{4,}\/[\/\d\-\s]{1,6}\d)'
    num_doc2 = r'(?i)((?<=гражданск)[делуом\s№:]*|(?<=судебный приказ)[\s№:]*|(?<=судебному приказу)[\s№:]*)([\d\-\s]{4,}\/[\/\d\-\s]{1,6}\d)'
    num_case_il = r'(?i)(?<=дело)[\s№]*[\d\-\s\/]*(?=\s)'
    num_doc_il = r'(?i)(?<=серия )[\D]*[\d\s]+(?=\w)'
    num_ip = r'[\d\/\\-]+(ИП)'

    # Наименование суда
    tribun1 = r'(?i)(?<=[\/\-\d|года|г\.] )(Мировой|и\.о\.|врио|исполняющий обязанности)[\s\S]+(?=\,\s+рассмотрев|\s+рассмотрев|\s+вынес)'
    tribun2 = r'(?i)((Мировой)|(и\.о\.)|(исполняющий обязанности))[\s\S]+(.ru)'
    tribun3 = r'(?i)((?<=[\d|\w|г\.] )(Мировой|и\.о\.|врио|исполняющий обязанности|Судья)[\s\S]+(?=\s+рассмотрев |\s+в составе |\s+при секретаре ))|((?<=года)[\S\s]+(?=\s+в составе))'
    tribun5 = r'(?i)(?<=года)[\S\s]+(?=\s+в составе)'
    tribun4 = r'((?<=г. )|(?<=\) ))([А-Я][\w\s\d№]+)(?=\s\()'

    # Наименование СПИ
    bailiff = r'(?i)(судебный|старший|СПИ)[^(]*'

    # ФИО/Наименование
    name_debt = r'(?i)(((?<=должника )|(?<=должника: )|(?<=должника, )|(?<=договору: ))(([\w]+\s+[\w]+\s+[\w]+(?=\,))|([\w]+\s+[\w]+\s+[\w]+\s+[\w]+(?=\,))|([\w]+\s+[\w]+\s+[\w]+)|([\w]+\s+[\w]+\s+[\w]+\s+[\w]+)))|(([\w]+\s+[\w]+\s+[\w]+))((?=\, \d{2})|(?= в пользу)|(?=\, род))'   # ФИО должника
    name_cred = r'(?i)(о|у|«)[\D\s]+(ч|ча|»|ц)(?= |\,)'   # Наименование взыскателя
    name_cred_res = r'(?i)((?<=взыскателя: )|(?<=взыскатель: ))[^,]*'
    name_debt_opr = r'((?<=с )|(?<=к )|(?<=должника )|(?<=должнику )|(?<=в отношении ))(([А-Я]\w+\s+[А-Я]\w+\s+[А-Я]\w+)|([А-Я]\w+\s+[А-Я]\.\s*[А-Я]\.))'
    name_debt_res = r'([А-Я]\w+\s+[А-Я]\w+\s+[А-Я]\w+)|([А-Я]\w+\s+[А-Я]\.\s*[А-Я]\.)'
    name_debt_il = r'((?<=с )|(?<=к )|(?<=c  )|(?<=к  ))(([А-Я]\w+\s+[А-Я]\w+\s+[А-Я]\w+)|([А-Я]\w+\s+[А-Я]\.\s*[А-Я]\.))'

    # Адрес
    add_debt = r'(?i)(?<=адресу: )[\S\s]+((д\.|дом|кв\.)(| )\d+)'  # Адрес должника
    add_cred = r'(?i)(?<=адрес: )[\S\s]+((офис|помещение)(| )\d+)'                # Адрес взыскателя

    # Номер кредитного договора
    num_kd1 = r'((?<=№ )|(?<=№))[\d\-\/]{6,}|[\d\/ \-]{8,}'
    num_kd2 = r'((?<=договору кредита)[\s№:]*|(?<=договор кредита)[\s№:]*|(?<=кредитному договору)[\s№:]*|(?<=кредитный договор)[\s№:]*|(?<=кредитного договора)[\s№:]*|(?<=займа)[\s№:]*)([\d\-\s\/()]*\w*[\d\-\s\/()]*)(?=\s+от)'

    # Сумма
    summa_rub = r'(?i)[\d\s]+\,\d{2}(?=[\s(\w)]*руб)'      # Сумма долга
    summa_rub2 = r'(?i)((?<=сумме )\s*|(?<=размере )\s*)(\d+([\d\w\s\().]*)\d{2}((?=\s*коп)|(?=\s*кои)))|\d+\s+\d{3}(?=\s+руб)'      # Сумма долга
    summ_duty1 = r'(?i)[\d\s]+\,\d{2}(?=[\s(\w)]*руб)'      # Сумма пошлины
    summ_duty2 = r'(?i)((?<=сумме )\s*|(?<=размере )\s*)\d+([\d\w\s\().]*|[\d\s]*руб\.\s*|\s*рубля\s*)\d{2}(?=\s*коп)|\d[\d\s]{2,4}(?=\s+руб)'

    # Тип заявления
    statement_type = r'(?i)((о\s*)|(об\s*))(замене\s+стороны|пересмотре|взыскании\s+задолженности|взыскании\s+процентов|взыскании\s+судебных\s+расходов|процессуальном\s+правопреемстве|правопреемстве|выдаче\s+дубликата|индексации|индексацию|исправлении\s+описки|замене\s+взыскателя)'
    statement_type_dec = r'(?i)((о\s*)|(об\s*)|(по\s*))(расторжении\s+кредитного\s+договора|взыскании\s+задолженности|взыскании\s+процентов|взыскании\s+судебных\s+расходов|административному\s+иску|обращении\s+взыскания|несостоятельности|банкротстве)'

    name_doc_res = r'(?i)П\s*о\s*с\s*т\s*а\s*н\s*о\s*в\s*л\s*е\s*н\s*и\s*е[^(\d,]+'

    # Резолюция
    resolution = r'(?i)(признать\s+обоснованным|отказать|удовлетворить\s+частично|частично\s+удовлетворить|удовлетворить|выдать\s+дубликат|исправить\s+описку|оставить\s+без\s+движения|произвести\s+замену\s+стороны|взыскать|возвратить|без\s+удовлетворения|Отменить\s+судебный\s+приказ|отменить)'
    resolution_il = r'(?i)(индексации|о\s+взыскании\s+процентов|задолженности)'
    resolution_res = r'\w[\w\s()]+'

    # Для ИФНС
    heading_fns = r'(?i)(Ф\s*о\s*р\s*м\s*а\s*9\s*ф)|(сведения\s*об\s*открытых\s*банковских\s*счетах)'
    name_debt_fns = r'(?<=№ )[\w\s()]+(?=\s+ИНН:)|(?<=\d )[\w\s()]+(?=\s+ИНН:)|(?<=_ )[\w\s()]+(?=\s+ИНН:)|(?<=ФЛ: )[\w\s()]+(?=\s+Дата рож)'
    inn_debt_fns = r'(?<=ИНН: )\d+'
    birthday_debt_fns = r'(?i)(?<=Дата рождения: )\d{2}\.\d{2}\.\d{4}'
    inn_bank = r'(?<=ИНН/КПП: )\d+'
    bik_bank = r'(?<=БИК: )\d+|(?<=БИК : )\d+'

    ###########################
    #### Для СВОДОК ##########
    # Определение № Исполнительного производства
    pattern_number_case = r'(?i)\S+-ИП'

    # Определение имени должника, даты рождения и адреса
    pattern_name1 = r'(?i)[\w\s]+(?=\sрод)'
    pattern_name2 = r'(?i)[\w\s]+'
    pattern_birthday = r'\S+\.\d{4}'
    pattern_birthday_pfr = r'(?i)(?<=Дата рождения\S\s)[\d\.]{10}'
    pattern_add_reg = r'(?i)(?<=\d{2}\.\d{4}\s)[\w\s\S]+'
    pattern_add_reg2 = r'(?i)(?<=Адрес\S\s)+[\w\s\S]+(?=\S\sДата)+'

    # Определение СНИЛС
    pattern_num_snils = r'(?<=\D)\d{11}(?=\D)'

    # Определение ИНН
    pattern_num_inn = r'(?<=\D)\d{12}(?=\D)'

    # Определение паспортных данных
    pattern_type_passport = r'(?i)(?<=\s)[\w\s]+Федерации?'
    pattern_series_passport = r'((?<=\s)\d{2,4}(?=\s)+|(?<=\s)\d{2,4}(?=;))'
    pattern_num_passport = r'(?<=\D)\d{6,7}(?=\D)'
    pattern_date_passport = r'(?i)(?<=выдан\s)+\S+\.\d{4}'

    # Определение дохода
    pattern_sum_income = r'(?i)(?<=дохода\W\s)+[\d\s\S\W,\.]+(?=\S\sвалюта)+'
    pattern_date_income = r'(?i)(?<=получения\sдохода\S\s)+[\w\s,\.]+(?=\D)'

    # Определение места работы
    pattern_work2 = r'(?i)(?<=\|)[\S\s]+(?=\|адрес)|юридическое\s+лицо|пенсия'
    pattern_inn2 = r'(?i)(?<=ИНН\s)\d+'
    pattern_kpp2 = r'(?i)(?<=КПП\s)\d+'

    pattern_work = r'(?i)(?<=Наименование\S\s)[\S\w\s]+((?=\sИНН)|([^;])+)|юридическое\s+лицо|пенсия'
    # pattern_work = r'(?i)юридическое\s+лицо|пенсия'
    pattern_inn = r'(?<=\D)\d{10,12}(?=\D)'
    pattern_kpp = r'(?<=\D)\d{9}(?=\D)'

    # Определение номера телефона
    pattern_tell = r'(?:\+|\d)[\d\-\(\) ]{9,}\d'

    # Определение данных по недвижимости
    pattern_type_realti = r'(?i)(?<=недвижимости\S\s)+[\w\s\S]+(?=\W\sплощадь)+'
    pattern_square_realti = r'(?i)(?<=\S\s)+[\d\W]+кв.м.'
    pattern_num_realti = r'(?:\d)[\d\:]{10,}\d'
    pattern_add_realti = r'(?i)(?<=адресу\S\s)+[\w\s\S]+(?=\W\sкадастровый)+'

    # pattern_type_realti2 = r'(?i)(?<=недвижимости\S\s)+[\w\s\S]+(?=\W\sплощадь)+'
    pattern_square_realti2 = r'(?i)(?<=\|)[\d\.\s]+(?=\s+кв\.м\.)'
    pattern_num_realti2 = r'[\d\:]{12,}(?=\|)'
    pattern_add_realti2 = r'(?i)(?<=адрес:\s)[\w\s\S]+(?=\|рег)'

    # Определение транспортного средства
    pattern_type_ts = r'(?i)(?<=средства\S\s).+?(?=;)'
    pattern_model_ts = r'(?i)(?<=\;\s)+[\d\w\s\-]+(?=\W\s\d{4})'
    pattern_date_ts = r'(?i)(?<=\;\s)+[\d].+?(?=;)'
    pattern_vin_ts = r'(?i)(?<=VIN\s)+[\d\w]{15,}\d'
    pattern_num_ts = r'(?i)(?<=г/н\s)+[\d\w]{4,7}\d'
    pattern_pts_ts = r'(?i)(?<=регистрации\S\s)+[\d\w]{8,}\d'

    pattern_type_ts2 = r'(?i)(?<=марка\s)[\w\d\s]+(?=\|)'
    pattern_model_ts2 = r'(?i)(?<=модель\s)[\d\w\s]+(?=\|)'
    pattern_date_ts2 = r'(?i)(?<=|)\d{4}(?=\s+г)'
    pattern_vin_ts2 = r'(?i)(?<=VIN\s)[\w\d]+(?=\|)'
    pattern_num_ts2 = r'(?i)(?<=г.н.\s)[\d\w]+(?=\|)'
    pattern_pts_ts2 = r'\d{2}\.\d{2}\.\d{4}'

    # Определение банковских счетов и остатков
    pattern_bik_bank = r'(?<=\D)\d{9}(?=\D)'
    pattern_bik_bank_2 = r'(?i)(?<=БИК\s)\d{9}(?=\|)'
    pattern_sum_bank = r'(?i)(?<=счета\S\s)+[\d\W]*\d'
    pattern_sum_bank_2 = r'(?i)(?<=сумма\s)[\d\.\,]+(?=\|)'
    pattern_account_bank = r'\d{20}'
    pattern_currency_bank = r'(?i)(?<=счета\S\s)+[\D\s]+(?=\;\sсведения)+'
    pattern_currency_bank_2 = r'(?i)(?<=валюте\s)[\w\s]+(?=\|)'


